In [1]:
import numpy as np
import pandas as pd

In [19]:
ar1 = np.arange(10).reshape(2,5)
df = pd.DataFrame(ar1,columns=list('abcde'))
df.to_csv('../Data/test.csv')

In [20]:
data = pd.read_csv('../Data/test.csv',index_col=0)
data1 = data.copy()
data1 = data1.rename(columns={'a':'Name','b':'Age','c':'job_code','d':'Salary','e':'home_location'})

In [21]:
data1['alive'] = np.random.choice([0,1])
data1.set_index('Name')
data1 = data1.rename(index={0:'A',1:'B'})

In [22]:
data1.loc['C']=0
data1.loc['D']=0

In [23]:
data1.to_csv('../Data/test1.csv')
data1 = pd.read_csv('../Data/test1.csv',index_col=0)
#data1.to_csv('../Data/test1.csv',index=False)

In [24]:
data1

   Name  Age  job_code  Salary  home_location  alive
A     0    1         2       3              4      1
B     5    6         7       8              9      1
C     0    0         0       0              0      0
D     0    0         0       0              0      0

In [31]:
# json file  
#json DICT 형식으로 저장됨 -- {key:value}

In [32]:
data1.iloc[2]=1
data1.iloc[3]=2

In [33]:
data1.to_json('../Data/test2.json')
data_J = pd.read_json('../Data/test2.json')
data_J

   Name  Age  job_code  Salary  home_location  alive
A     0    1         2       3              4      1
B     5    6         7       8              9      1
C     1    1         1       1              1      1
D     2    2         2       2              2      2